Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If an expression does not specify a namespace the _current context object_ is derived from the position of the tag. By default, the current context object represents the data passed to the template instance. However, sections may change the current context object. A typical example is the <<let_section,`let`>> section that can be used to define named local variables:
ja_jp: 式が名前空間を指定しない場合、_カレントコンテキストオブジェクト_ はタグの位置から派生します。デフォルトでは、現在のコンテキストオブジェクトは、テンプレートインスタンスに渡されたデータを表します。しかし、セクションは現在のコンテキストオブジェクトを変更することがあります。典型的な例は、<<let_section,`let`>> セクションで、名前付きローカル変数を定義するために使用することができます。

source: If an expression does not specify a namespace, the _current context object_ is derived from the position of the tag. By default, the current context object represents the data passed to the template instance. However, sections may change the current context object. A typical example is the <<let_section,`let`>> section that can be used to define named local variables:
ja_jp: 式が名前空間を指定しない場合、_カレントコンテキストオブジェクト_ はタグの位置から導出されます。 デフォルトでは、現在のコンテキストオブジェクトは、テンプレートインスタンスに渡されたデータを表します。 ただし、セクションは現在のコンテキストオブジェクトを変更することがあります。 典型的な例は、名前付きローカル変数を定義するために使用できる <<let_section,`let`>> セクションです。

source: If an expression does not specify a namespace, the _current context object_ is derived from the position of the tag. By default, the current context object represents the data passed to the template instance. However, sections may change the current context object. A typical example is the xref:let_section[`let`] section that can be used to define named local variables:
ja_jp: 式が名前空間を指定しない場合、 _現在のコンテキストオブジェクト_ は、タグの位置から導出されます。デフォルトでは、カレントコンテキストオブジェクトは、テンプレートインスタンスに渡されたデータを表します。ただし、セクションによってカレントコンテキストオブジェクトを変更することができます。典型的な例としては xref:let_section[let] セクションで、名前付きローカル変数を定義するために使用することができます:

source: If an extension for schema registry, such as `quarkus-apicurio-registry-avro` or `quarkus-confluent-registry-avro`, is present, Dev Services for Apicurio Registry automatically starts an Apicurio Registry instance in dev mode and when running tests. Also, all Kafka channels in SmallRye Reactive Messaging are automatically configured to use this registry. This automatic configuration only applies to serializers and deserializers from Apicurio Registry serde libraries and Confluent Schema Registry serde libraries, because their properties are set:
ja_jp: スキーマレジストリのエクステンション（例: `quarkus-apicurio-registry-avro` や `quarkus-confluent-registry-avro`）が存在する場合、Dev Services for Apicurio Registry は開発モードおよびテスト実行時に Apicurio Registry インスタンスを自動的に起動します。また、SmallRye Reactive Messaging のすべての Kafka チャネルは、このレジストリを使用するように自動的に設定されます。この自動設定は、Apicurio Registry serde ライブラリおよび Confluent Schema Registry serde ライブラリのシリアライザーとデシリアライザーにのみ適用されます。これは、それらのプロパティーが設定されているためです。

source: If an extension for schema registry, such as `quarkus-apicurio-registry-avro` or `quarkus-confluent-registry-avro`, is present, Dev Services for Apicurio Registry automatically starts an Apicurio Registry instance in dev mode and when running tests. Also, all Kafka channels in SmallRye Reactive Messaging are automatically configured to use this registry. This automatic configuration only applies to serializers and deserializers from Apicurio Registry serde libraries and Confluent Schema Registry serde libraries, because there properties are set:
ja_jp: `quarkus-apicurio-registry-avro` や `quarkus-confluent-registry-avro` のようなスキーマレジストリのエクステンションが存在する場合、Dev Services for Apicurio Registryは、開発モードやテスト実行時に自動的にApicurio Registryインスタンスを起動します。また、SmallRye Reactive MessagingのすべてのKafkaチャンネルは、このレジストリを使用するように自動的に設定されます。これらのプロパティが設定されているので、この自動設定は、Apicurio Registry serde ライブラリおよび Confluent Schema Registry serde ライブラリのシリアライザーおよびデシリアライザーにのみ適用されます。

source: If an extension includes a dependency condition in its descriptor, other extensions may configure a conditional dependency on it by simply adding `<optional>true</optional>` to the dependency configuration. In our example it would look like this:
ja_jp: あるエクステンションの記述子に依存条件が設定されていた場合、他のエクステンションは依存関係の設定に `<optional>true</optional>` を追加するだけで、そのエクステンションに条件付きの依存関係を設定することができます。この例では、次のようになります。

source: If an extension intends to provide JSON related customization, it is strongly advised to provide customization for both Jackson and JSON-B.
ja_jp: エクステンションがJSON関連のカスタマイズを提供しようとする場合は、JacksonとJSON-Bの両方のカスタマイズを提供することを強くお勧めします。

source: If an extension needs nested non-application endpoints:
ja_jp: エクステンションがネストした非アプリケーションのエンドポイントを必要とする場合:

source: If an extension was configured with a dependency condition in its descriptor, other extensions may configure a conditional dependency on it by simply adding `<optional>true</optional>` to the dependency configuration. In our example it would look like this:
ja_jp: あるエクステンションの記述子に依存条件が設定されていた場合、他のエクステンションは依存関係の設定に `<optional>true</optional>` を追加するだけで、そのエクステンションに条件付きの依存関係を設定することができます。この例では、次のようになります。

source: If an inactive bean is injected somewhere, or is dynamically looked up, an `InactiveBeanException` is thrown. The error message contains the reason (from the `ActiveResult`), the cause chain (also from the `ActiveResult`), and possibly also a list of all injection points that resolve to this bean.
ja_jp: 非アクティブな Bean がどこかに注入されるか、動的に検索されると、 `InactiveBeanException` が出力されます。 エラーメッセージには、理由 (`ActiveResult` から)、原因のチェーン (同じく `ActiveResult` から) が含まれ、この Bean に解決されるすべての注入ポイントのリストがさらに含まれる場合もあります。

source: If an injection point declares no other qualifier than `@All` then `@Any` is used, i.e. the behavior is equivalent to `@Inject @Any Instance<Service>`.
ja_jp: インジェクションポイントが `@All` 以外の修飾子を宣言していない場合、 `@Any` が使用されます。つまり、動作は `@Inject @Any Instance<Service>` と同等です。

source: If an offering is not configured, the complete catalog of extensions returned by the registry will be provided to the user.
ja_jp: オファリングが設定されていない場合、レジストリーから返されるエクステンションの完全なカタログがユーザーに提供されます。

source: If an overload situation is signalled, priority load shedding is invoked.
ja_jp: 過負荷状況が通知されると、優先負荷制限が呼び出されます。

source: If another Quarkus extension relies on an inactive datasource, that extension might fail to start.
ja_jp: 他のQuarkusエクステンションが非アクティブなデータソースに依存している場合、 そのエクステンションの起動に失敗することがあります。

source: If any Elasticsearch-related extension is present (e.g.
ja_jp: Elasticsearch関連のエクステンションがある場合（例：

source: If any Elasticsearch-related extension is present (e.g. `quarkus-elasticsearch-rest-client` or `quarkus-hibernate-search-orm-elasticsearch`), Dev Services for Elasticsearch automatically starts an Elasticsearch server in dev mode and when running tests. So, you don't have to start a server manually. The application is configured automatically.
ja_jp: Elasticsearch関連のエクステンションがある場合（例： `quarkus-elasticsearch-rest-client` や `quarkus-hibernate-search-orm-elasticsearch` ）、Dev Services for Elasticsearchは開発モードやテスト実行時に自動的にElasticsearchサーバを起動します。そのため、手動でサーバを起動する必要はありません。アプリケーションは自動的に設定されます。

source: If any Kafka-related extension is present (e.g. `quarkus-messaging-kafka`), the Quarkus Dev UI is extended with a Kafka broker management UI. It is connected automatically to the Kafka broker configured for the application.
ja_jp: Kafka関連のエクステンションがある場合（例： `quarkus-messaging-kafka` ）、Quarkus Dev UIはKafkaブローカー管理UIで拡張されます。 アプリケーション用に設定されたKafkaブローカーに自動的に接続されます。

source: If any Kafka-related extension is present (e.g. `quarkus-messaging-kafka`), Dev Services for Kafka automatically starts a Kafka broker in dev mode and when running tests. So, you don't have to start a broker manually. The application is configured automatically.
ja_jp: Kafka関連のエクステンション（例： `quarkus-messaging-kafka` ）がある場合、Dev Services for Kafkaは開発モードやテスト実行時に自動的にKafkaブローカーを起動します。 そのため、手動でブローカーを起動する必要はありません。 アプリケーションは自動的に設定されます。

source: If any Kafka-related extension is present (e.g. `quarkus-smallrye-reactive-messaging-kafka`), the Quarkus Dev UI is extended with a Kafka broker management UI. It is connected automatically to the Kafka broker configured for the application.
ja_jp: Kafka関連のエクステンションがある場合（例： `quarkus-smallrye-reactive-messaging-kafka` ）、Quarkus Dev UIにKafkaブローカー管理UIが拡張されます。アプリケーション用に設定されたKafkaブローカーに自動的に接続されます。

source: If any Kafka-related extension is present (e.g. `quarkus-smallrye-reactive-messaging-kafka`), Dev Services for Kafka automatically starts a Kafka broker in dev mode and when running tests. So, you don't have to start a broker manually. The application is configured automatically.
ja_jp: Kafka関連のエクステンション（例： `quarkus-smallrye-reactive-messaging-kafka` ）が存在する場合、Dev Services for Kafkaは、開発モードやテストの実行時に自動的にKafkaブローカーを起動します。そのため、ブローカーを手動で起動する必要はありません。アプリケーションは自動的に構成されます。

source: If any Kogito process-related extension is present (e.g.
ja_jp: Kogitoプロセス関連のエクステンションがある場合（例

source: If any Kogito process-related extension is present (e.g. `kogito-quarkus` or `kogito-quarkus-processes`), Dev Services for Kogito automatically starts a Data Index in dev mode. So, you don't have to start it manually or have any other service set-up manually. The application is configured automatically, meaning that will replicate any Kogito messaging events related to Process Instances and User Tasks into the provisioned Data Index instance.
ja_jp: いずれかのKogitoプロセス関連のエクステンションが存在する場合（例： `kogito-quarkus` または `kogito-quarkus-processes` ）、Dev Services for Kogitoは自動的にdevモードでデータ・インデックスを開始します。そのため、手動で起動したり、他のサービスを手動でセットアップする必要はありません。アプリケーションは自動的に構成され、プロセス・インスタンスやユーザー・タスクに関連するあらゆるKogitoメッセージング・イベントをプロビジョニングされたData Indexインスタンスにレプリケートすることを意味します。

source: If any of the available validation is disturbing your development, disable Qute validation for the current file with a single click, using the button that appears on the top right of the editor bar when Qute templates are opened, or for the entire workspace using a “Quick Fix” that appears on every Qute related diagnostic.
ja_jp: 利用可能な検証のいずれかが、開発の妨げになっている場合、Qute テンプレートを開 く際にエディタバーの右上に表示されるボタンを使って、現在のファイルの Qute 検証 をワンクリックで無効にするか、Qute 関連の診断に毎回表示される「クイックフィックス」 を使ってワークスペース全体の検証を無効にしてください。

source: If any of the gRPC services or server interceptors throw an (custom) exception, you can add your own https://github.com/quarkusio/quarkus/extensions/grpc/api/src/main/java/io/quarkus/grpc/ExceptionHandlerProvider.java[ExceptionHandlerProvider] as a CDI bean in your application, to provide a custom handling of those exceptions.
ja_jp: gRPCサービスやサーバーインターセプターが（カスタム）例外を投げる場合、アプリケーションのCDI Beanとして独自の https://github.com/quarkusio/quarkus/extensions/grpc/api/src/main/java/io/quarkus/grpc/ExceptionHandlerProvider.java[ExceptionHandlerProvider] を追加し、これらの例外のカスタムハンドリングを提供することができます。

source: If any of these checks fail, the application will not start.
ja_jp: これらのチェックのいずれかが失敗すると、アプリケーションは起動しません。

source: If applicable, MDC data is stored in a _duplicated context_, which is an isolated context for processing a single task (request).
ja_jp: 該当する場合、MDCデータは、単一のタスク（リクエスト）を処理するための分離されたコンテキストである、 _複製されたコンテキスト_ に格納されます。

source: If applicable, MDC data is stored in a _duplicated context_, which is an isolated context for processing a single task or request.
ja_jp: 該当する場合、MDC データは複製されたコンテキストに保存されます。これは、単一のタスクまたはリクエストを処理するための分離されたコンテキストです。

source: If applicable, Quarkus stores MDC data in a Vert.x duplicated context, which isolates processing for a single task or request.
ja_jp: 該当する場合、Quarkus は MDC データを Vert.x の複製コンテキストに保存します。これにより、単一のタスクまたはリクエストの処理が分離されます。

source: If automatically declare DLQ, we can choose different modes of DLQ [lazy, default] Type: _string_
ja_jp: DLQを自動的に宣言する場合、DLQのモード [lazy, default] を選択することができます。 Type: _string_

source: If automatically declare DLQ, we can choose different types of DLQ [quorum, classic, stream] Type: _string_
ja_jp: DLQを自動的に宣言する場合、DLQの種類 [quorum, classic, stream] を選ぶことができます。 Type: _string_

source: If automatically declare queue, we can choose different modes of queue [lazy, default] Type: _string_
ja_jp: 自動的にキューを宣言する場合、キューのモード [lazy, default] を選択することができます。 Type: _string_

source: If automatically declare queue, we can choose different types of queue [quorum, classic, stream] Type: _string_
ja_jp: キューを自動的に宣言する場合、キューの種類 [quorum, classic, stream] を選ぶことができます。 Type: _string_

source: If both `configuration-uri` and `configuration` are configured for the same cache with the same Quarkus profile, `configuration-uri` gets preference over `configuration`.
ja_jp: `configuration-uri` と `configuration` の両方が同じ Quarkus プロファイルで同じキャッシュに設定されている場合、 `configuration-uri` が `configuration` より優先されます。

source: If both `scan-exclude-profiles` and `scan-profiles` are configured, *only* `scan-exclude-profiles` is checked.
ja_jp: `scan-exclude-profiles` と `scan-profiles` の両方が設定されている場合、`scan-exclude-profiles` *のみ* がチェックされます。

source: If both are mixed, the annotations are ignored and only the `packages` configuration properties are taken into account.
ja_jp: 両方が混在している場合はアノテーションが無視され、 `packages` の設定プロパティーのみが考慮されます。

source: If both are present, Quarkus prioritizes configuration properties from the YAML file first and then from the Properties file. However, to avoid confusion, we recommend removing the Properties file.
ja_jp: 両方が存在する場合、QuarkusはまずYAMLファイルからの設定プロパティを優先し、次にPropertiesファイルからの設定プロパティを読み込みます。ただし、混乱を避けるため、Propertiesファイルを削除することをお勧めします。

source: If both are specified then all non-Servlet web endpoints will be relative to `quarkus.http.root-path`, while Servlet's will be served relative to `{quarkus.http.root-path}/{quarkus.servlet.context-path}`.
ja_jp: 両方を指定した場合、サーブレット以外のすべてのウェブエンドポイントは `quarkus.http.root-path` からの相対的なものになり、サーブレットは `{quarkus.http.root-path}/{quarkus.servlet.context-path}` からの相対的なものになります。

source: If both files are present, {project-name} gives precedence to properties in the YAML file.
ja_jp: 両方のファイルが存在する場合、{project-name}はYAMLファイルのプロパティを優先します。

source: If both header variants (`Forwarded` and `X-Forwarded-*`) are enabled, the `Forwarded` header will have precedence.
ja_jp: ヘッダーの種類 (`Forwarded` と `X-Forwarded-*`) の両方が有効な場合、`Forwarded` のヘッダーが優先されます。

source: If both operands are of the same type that implements the `java.lang.Comparable` then the `Comparable#compareTo(T)` method is used to perform comparison.
ja_jp: 両方のオペランドが `java.lang.Comparable` を実装する同じ型である場合、比較を実行するために `Comparable#compareTo (T)` メソッドが使用されます。

source: If by any means you need to use a custom resource or one that is provided by one of the https://github.com/open-telemetry/opentelemetry-java/tree/main/sdk-extensions[OpenTelemetry SDK Extensions] you can create multiple resource producers. The OpenTelemetry extension will detect the `Resource` CDI beans and will merge them when configuring the OTel SDK.
ja_jp: カスタムリソースや、いずれかの link:https://github.com/open-telemetry/opentelemetry-java/tree/main/sdk-extensions[OpenTelemetry SDK Extensions] で提供されているカスタムリソースを使用する必要がある場合は、 複数のリソースプロデューサーを作成できます。OpenTelemetry エクステンションは `Resource` CDI Bean を検出し、OTel SDK 設定時にそれらをマージします。

source: If by any means you need to use a custom resource or one that is provided by one of the https://github.com/open-telemetry/opentelemetry-java/tree/main/sdk-extensions[OpenTelemetry SDK Extensions] you can create multiple resource producers. The OpenTelemetry extension will detect the `Resource` CDI beans and will merge them when configuring the tracer producer.
ja_jp: カスタムリソースや link:https://github.com/open-telemetry/opentelemetry-java/tree/main/sdk-extensions[OpenTelemetry SDK Extensions]で提供されているリソースを使用する必要がある場合は、複数のリソースプロデューサーを作成することができます。OpenTelemetryエクステンションは、 `Resource` CDI Beanを検出し、トレーサー・プロデューサーを構成する際にそれらをマージします。

source: If bytecode is recorded with `@Record(RUNTIME_INIT)` then it is executed from the application's main method. This code will be run on native executable boot. In general as little code as possible should be executed in this phase, and should be restricted to code that needs to open ports etc.
ja_jp: `@Record(RUNTIME_INIT)` でバイトコードが記録されている場合は、アプリケーションのメインメソッドから実行されます。このコードはネイティブ実行可能ファイルブートで実行されます。一般的に、このフェーズではできるだけ少ないコードを実行すべきであり、ポートを開く必要があるコードなどに限定すべきです。

source: If bytecode is recorded with `@Record(STATIC_INIT)` then it will be executed from a static init method on the main class. For a native executable build, this code is executed in a normal JVM as part of the native build process, and any retained objects that are produced in this stage will be directly serialized into the native executable via an image mapped file. This means that if a framework can boot in this phase then it will have its booted state directly written to the image, and so the boot code does not need to be executed when the image is started.
ja_jp: `@Record(STATIC_INIT)` でバイトコードが記録されている場合は、mainクラスの Static Init メソッドから実行されます。ネイティブビルドの場合、このコードはネイティブビルドプロセスの一部として通常のJVMで実行され、この段階で生成されたリテインドオブジェクトは、イメージマップされたファイルを介してネイティブ実行可能ファイルに直接シリアル化されます。つまり、この段階でフレームワークが起動できれば、そのフレームワークの起動状態がイメージに直接書き込まれるため、イメージの起動時にブートコードを実行する必要がありません。

source: If compression support is enabled then the response body is compressed if:
ja_jp: 圧縮サポートが有効であれば、以下の場合にレスポンスボディが圧縮されます。

source: If customizing the `ValidatorFactory` through the available configuration properties and the CDI beans above doesn't cover your requirements, you can customize it further by registering `ValidatorFactoryCustomizer` beans.
ja_jp: 利用可能な設定プロパティと上記の CDI Bean を介して `ValidatorFactory` をカスタマイズしても要件が満たされない場合は、 `ValidatorFactoryCustomizer` Bean を登録することでさらにカスタマイズできます。

source: If defined on a class, it is equivalent to defining it on all the methods of the class marked with `@Transactional`. The configuration defined on a method takes precedence over the configuration defined on a class.
ja_jp: クラスに定義されている場合、 `@Transactional` でマークされたクラスのすべてのメソッドに定義されているのと同じことになります。メソッドに定義された場合は、クラスに定義された設定よりも優先されます。

source: If deployment is a success, Quarkus will output the endpoint URL of the example function to the console For Gradle, you must use the `--info` switch to see this output!
ja_jp: デプロイメントが成功すると、Quarkus はサンプル関数のエンドポイント URL をコンソールに出力します。 Gradle の場合、この出力を表示するには `--info` スイッチを使用する必要があります。

source: If deployment is a success, Quarkus will output the endpoint URL of the example function to the console:
ja_jp: デプロイが成功すると、Quarkus は、サンプル関数のエンドポイント URL をコンソールに出力します:

source: If deployment is a success, the azure plugin will tell you the base URL to access your function.
ja_jp: デプロイが成功した場合、azure プラグインは Function にアクセスするためのベース URL を教えてくれます。

source: If different sources provide the user credentials, you can combine authentication mechanisms. For example, you can combine the built-in Basic and the Quarkus `quarkus-oidc` Bearer token authentication mechanisms.
ja_jp: 異なるソースからユーザー認証情報が提供される場合は、認証メカニズムを組み合わせることができます。 たとえば、組み込みの Basic 認証メカニズムと Quarkus の `quarkus-oidc` べアラートークン認証メカニズムを組み合わせることができます。

source: If disabled then the special constant `NOT_FOUND` is written to the output by default.
ja_jp: 無効な場合、デフォルトで特別な定数 `NOT_FOUND` が出力に書き込まれます。

source: If either `client_secret_jwt` or `private_key_jwt` authentication method is used, you can customize the JWT signature algorithm, key identifier, audience, subject, and issuer.
ja_jp: `client_secret_jwt` または `private_key_jwt` 認証メソッドを使用する場合、JWT 署名アルゴリズム、キー識別子、オーディエンス、サブジェクト、発行者をカスタマイズできます。

source: If either `client_secret_jwt` or `private_key_jwt` authentication methods are used then the JWT signature algorithm, key identifier, audience, subject and issuer can be customized, for example:
ja_jp: `client_secret_jwt` または `private_key_jwt` のいずれかの認証方法を使用する場合は、JWT 署名アルゴリズム、鍵識別子、オーディエンス、サブジェクト、および発行者をカスタマイズすることができます。以下に例を示します。

source: If either `client_secret_jwt` or `private_key_jwt` authentication methods are used, then the JWT signature algorithm, key identifier, audience, subject, and issuer can be customized, for example:
ja_jp: `client_secret_jwt` と `private_key_jwt` のいずれかの認証方法を使用する場合、JWT 署名アルゴリズム、鍵識別子、オーディエンス、サブジェクト、発行者などをカスタマイズすることが可能です。

source: If enabled then a missing property will always result in a `TemplateException` and the rendering is aborted. You can use _default values_ and _safe expressions_ in order to suppress the error.
ja_jp: これを有効にすると、プロパティーが見つからない場合、常に `TemplateException` が発生し、レンダリングが中断されます。このエラーを抑制するために、_default values_ や _safe expressions_ を使用することができます。

source: If enabled, Undertow records the request start timestamp. Useful for timing, logging and request tracing.
ja_jp: 有効にすると、 Undertow はリクエスト開始のタイムスタンプを記録します。タイミング計測、ロギング、およびリクエストトレースに役立ちます。

source: If enabled, consumer's offset will be periodically committed in the background by the underlying Kafka client, ignoring the actual processing outcome of the records. It is recommended to NOT enable this setting and let Reactive Messaging handles the commit. Type: _boolean_
ja_jp: この設定を有効にすると、コンシューマーのオフセットは、レコードの実際の処理結果を無視して、基礎となるKafkaクライアントによってバックグラウンドで定期的にコミットされます。この設定を有効にしないで、Reactive Messaging にコミットを任せることをお勧めします。 Type: _boolean_

source: If enabled, the sentinel client will additionally create a connection to one sentinel node and watch for failover events. When new master is elected, all connections to the old master are automatically closed and new connections to the new master are created. Automatic failover makes sense for connections executing regular commands, but not for connections used to subscribe to Redis pub/sub channels.
ja_jp: 有効にすると、sentinel クライアントは 1 つの sentinel ノードへの接続を追加で作成し、フェイルオーバーイベントを監視します。 新しいマスターが選出されると、古いマスターへのすべての接続が自動的に閉じられ、新しいマスターへの新しい接続が作成されます。 自動フェイルオーバーは、通常のコマンドを実行する接続には意味がありますが、Redis pub/sub チャネルをサブスクライブするために使用される接続には意味がありません。

source: If enabling `readCompacted`, a consumer reads messages from a compacted topic rather than reading a full message backlog of a topic. A consumer only sees the latest value for each key in the compacted topic, up until reaching the point in the topic message when compacting backlog. Beyond that point, send messages as normal. Only enabling `readCompacted` on subscriptions to persistent topics, which have a single active consumer (like failure or exclusive subscriptions). Attempting to enable it on subscriptions to non-persistent topics or on shared subscriptions leads to a subscription call throwing a `PulsarClientException`.
ja_jp: `readCompacted` を有効にすると、コンシューマーはトピックの完全なメッセージ バックログを読み取るのではなく、圧縮されたトピックからメッセージを読み取ります。 コンシューマーは、バックログを圧縮するときのトピック メッセージ内のポイントに到達するまで、圧縮されたトピック内の各キーの最新の値のみを参照します。そのポイントを超えると、通常どおりメッセージを送信します。 アクティブなコンシューマーが 1 つある永続トピック (失敗または排他サブスクリプションなど) へのサブスクリプションでのみ、 `readCompacted` を有効にします。 非永続トピックへのサブスクリプションまたは共有サブスクリプションでこれを有効にしようとすると、サブスクリプション呼び出しで `PulsarClientException` がスローされます。

source: If everything is working as expected, you are redirected to the Keycloak server to authenticate.
ja_jp: すべてが期待通りに動いていれば、Keycloakサーバーにリダイレクトされ、認証が行われます。

source: If everything is working as expected, you should be redirected to the Keycloak server to authenticate.
ja_jp: すべてが期待通りに動作している場合は、認証のためにKeycloakサーバーにリダイレクトされるはずです。

source: If everything is working as expected, you should be redirected to the Keycloak server to authenticate. Note that the requested path defines a `default` tenant which we don't have mapped in the configuration file. In this case, the default configuration will be used.
ja_jp: すべてが期待どおりに機能している場合は、認証のために Keycloak サーバーにリダイレクトする必要があります。リクエストされたパスは、設定ファイルにマップされていない `default` テナントを定義していることに注意してください。この場合、デフォルトの設定が使用されます。

source: If everything went well the Color service is accessible on http://color-service.127.0.0.1.nip.io. You should have `Hello from Red!` and `Hello from Blue!` response randomly.
ja_jp: すべてがうまくいった場合、 http://color-service.127.0.0.1.nip.io で Color サービスにアクセスできます。 `Hello from Red!` と `Hello from Blue!` の応答がランダムに表示されるはずです。

source: If everything works as expected, you are redirected to the Keycloak server to authenticate.
ja_jp: すべてが期待通りに動作すると、認証のためにKeycloakサーバーにリダイレクトされます。
